{
  "career": [
    {
      "name": "VJV IT Solutions",
      "href": "https://vjvtech.com/",
      "title": "Sofware Developer",
      "logo": "/vjvitsolutions.png",
      "start": "Jan 2024",
      "end": "Present",
      "description": [
        "Tech Stack: ReactJs, TypeScript, NodeJs, ExpressJs, MongoDB, Redis, AWS, Nginx, ShadcnUI",
        "Developing the frontend of an event management platform that enables users to complete their profiles and receive matches based on shared interests.",
        "Implemented a dynamic matchmaking system, allowing users to connect with five other attendees for 15-minute interactions during offline events.",
        "Designed and optimized the event registration flow, ensuring a seamless user experience for signing up and participating in networking sessions.",
        "Developing the backend of the SPHA (Surgery and Post Hospital Assistance) website using Node.js, Express.js, and MongoDB, enhancing user registration and search functionality for hospitals, doctors, and clinics.",
        "Optimizing the platform to ensure seamless 24/7 access to tailored healthcare resources, aiding senior citizens in post-surgery recovery and hospital assistance."
      ]
    },
    {
      "name": "Sportzzbook",
      "href": "https://www.sportzzbook.com",
      "title": "Sofware Developer Intern",
      "logo": "/sportzzbook.png",
      "start": "Oct 2024",
      "end": "Jan 2025",
      "description": [
        "Tech Stack: TypeScript, ReactJs, ReactNative, NodeJs, ShadcnUI",
        "Developed the company's web platform using React.js, ensuring a responsive, high-performance interface that provides an intuitive and seamless user experience",
        "Collaborating with the team to build the mobile app using React Native, focusing on delivering a seamless mobile experience"
      ]
    },
    {
      "name": "AviSoft",
      "href": "https://avisoft.io/",
      "title": "Full Stack Developer Intern",
      "logo": "/avisoft.jpg",
      "start": "Feb 2024",
      "end": "July 2024",
      "description": [
        "Tech Stack: TypeScript, ReactJs, NextJs, MongoDB, NodeJs, ExpressJs, DaisyUI",
        "Migration Project: Successfully migrated a client website from AngularJS to Next.js, significantly improving performance and SEO rankings.",
        "UI Design: Leveraged the DaisyUI library for efficient, responsive, and modern UI component design, enhancing the user experience.",
        "Performance Optimization: Implemented server-side rendering with Next.js to optimize loading speeds and boost overall application performance."
      ]
    }
  ]
}
